Catalogs/рс_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_ИнформационныеБазы</Name>
			<Comment>Хранит общ. список объектов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Метаданные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>рс_Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.рс_ВидыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автоматически</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_ИнформационныеБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	 Объект.НазваниеВерсияКонфигурации =  Метаданные.Имя + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	//Объект.рс_Метаданные.Очистить(); 
	
	ЗаполнитьТЧМетаданные("Справочники"); 
	ЗаполнитьТЧМетаданные("Документы"); 
	ЗаполнитьТЧМетаданные("РегистрыСведений");
	ЗаполнитьТЧМетаданные("РегистрыНакопления");
	ЗаполнитьТЧМетаданные("Отчеты");

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧМетаданные(Имя) 
	
	Если Имя = "Справочники" Тогда 
		ИмяДляЗапроса = "Справочник";
	ИначеЕсли Имя = "Документы" Тогда
		ИмяДляЗапроса = "Документ";
	ИначеЕсли Имя = "РегистрыСведений" Тогда
		ИмяДляЗапроса = "РегистрСведений"; 
	ИначеЕсли Имя = "РегистрыНакопления" Тогда
		ИмяДляЗапроса = "РегистрНакопления";
	Иначе
		ИмяДляЗапроса = Неопределено;
	КонецЕсли;	
		
	Для Каждого Метаданное Из Метаданные[Имя] Цикл  
		Если Не ИмяДляЗапроса = Неопределено Тогда 
			КоличествоОбъектов = ПолучитьКоличествоОбъектовМетаданных(ИмяДляЗапроса, Метаданное.Имя);
			Если Объект.ПоКоличеству И КоличествоОбъектов = 0 Тогда
				Продолжить;
			КонецЕсли;                              
		КонецЕсли;
		
		рс_ВидОбъекта 	= Перечисления.рс_ВидыОбъектов[Имя];
		
		Структура = Новый Структура;
		Структура.Вставить("Имя"		, Метаданное.Имя);
		Структура.Вставить("ВидОбъекта"	, рс_ВидОбъекта);
		
		ПоискСтроки = Объект.рс_Метаданные.НайтиСтроки(Структура);
		
		Если ПоискСтроки.Количество() > 0 Тогда 
			Продолжить;	
		КонецЕсли;	
		
		ПоискОбъект	 = рс_ОбщийМодульСервер.НайтиОбъектРС(рс_ВидОбъекта, Метаданное.Имя);  

		Если Не ЗначениеЗаполнено(ПоискОбъект) Тогда  
			Структура = Новый Структура;
			Структура.Вставить("Индентификатор"	, Метаданное.Имя);
			Структура.Вставить("Наименование"	, Метаданное.Синоним);  
			Структура.Вставить("Вид" 			, рс_ВидОбъекта);			
			
			Попытка
				рс_Объект = рс_ОбщийМодульСервер.СоздатьОбъектРС(Структура);
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение СтрШаблон("Ошибка при загрузке %1 ""%2"": %3", Имя, Метаданное.Имя, ТекстОшибки);
			КонецПопытки;
			
			ПоискОбъект = рс_Объект;
		КонецЕсли;
		
		рс_ТЧ 			= Объект.рс_Метаданные; 		
		рс_Массив 		= Новый Массив; 		
		рс_Структура 	= Новый Структура;
		
		рс_Структура.Вставить("Имя"				, Метаданное.Имя);
		рс_Структура.Вставить("Синоним"			, Метаданное.Синоним);
		рс_Структура.Вставить("ВидОбъекта"		, Перечисления.рс_ВидыОбъектов[Имя]);
		рс_Структура.Вставить("Количество"		, КоличествоОбъектов);
		рс_Структура.Вставить("рс_Объект"		, ПоискОбъект);
        рс_Структура.Вставить("Автоматически"	, Истина);
		
		рс_Массив.Добавить(рс_Структура);
		
		рс_ОбщийМодульСервер.ЗаполнитьТабличнуюЧастьИзПараметра(рс_ТЧ, рс_Массив, Ложь);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоОбъектовМетаданных(ВидМетаданных, ИмяМетаданных)
	Запрос = Новый Запрос;
	
	Если  ВидМетаданных = "РегистрСведений" Или ВидМетаданных = "РегистрНакопления" Тогда 
		Запрос.Текст = "ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Количество ИЗ "+ВидМетаданных+"."+ ИмяМетаданных + " Как Рег";
	Иначе 	
		Запрос.Текст = "ВЫБРАТЬ КОЛИЧЕСТВО(СпрОбъект.Ссылка) КАК Количество ИЗ " + ВидМетаданных + "." + ИмяМетаданных + " КАК СпрОбъект";
	КонецЕсли;
	
	Попытка
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Количество;
		КонецЕсли;
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат 0;
КонецФункции
